In [4]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {
    "name": ['harry', 'rohan', 'skillf', 'shubh'],
    "marks": [92, 34, 24, 17],
    "city": ['rampur', 'kolkata', 'bareilly', 'antartica']
}

In [8]:
df = pd.DataFrame(dict1) 
# we will store data frame in a variable
# data frame is like a excel sheet. with data frame help we can do fast indexing, we can also able to use numpy function

In [7]:
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [10]:
df.to_csv('friends.csv')   
# convert data frame into csv file
# syntax : df.to_csv ('filename.csv')

In [11]:
# if we don't want index in our csv file then
df.to_csv('friends_index_false.csv' , index = False)
# false first word should be in capital letter
# NOTE: index means row, aur column ko column hi bolte hain

In [12]:
df.head (2)
# ye suru ka 2 index dikhayega

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [13]:
df.head (3)
# ye suru ka 3 index dikhayega

     name  marks      city
0   harry     92    rampur
1   rohan     34   kolkata
2  skillf     24  bareilly

In [14]:
df.tail (2)
# ye last ka 2 index dikhayega

     name  marks       city
2  skillf     24   bareilly
3   shubh     17  antartica

In [15]:
df.tail (3)
# ye last ka 3 index dikhayega

     name  marks       city
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [17]:
df.describe ()
# jo bhi numerical column data hain uska count, mean.std (standard deviation),min,25%,50%,75% and max value btayga

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [22]:
# Read a csv file and store it in a variable
harry = pd.read_csv('vikram.csv')

In [23]:
harry

   Train no  Speed      City
0     12233      67    Delhi
1     12351      57  Kolkata
2     12561      87   mumbai
3     24376      45    patna
4     23425      90  asansol

In [28]:
harry['City']

0      Delhi
1    Kolkata
2     mumbai
3      patna
4    asansol
Name: City, dtype: object

In [29]:
harry['Train no']

0    12233
1    12351
2    12561
3    24376
4    23425
Name: Train no, dtype: int64

In [39]:
harry['Speed ']
# there is a space gap after Speed

0    67
1    57
2    87
3    45
4    90
Name: Speed , dtype: int64

In [47]:
harry['Speed '].head(2)

0    67
1    57
Name: Speed , dtype: int64

In [49]:
harry['Speed '][0]
# shows the value of speed is 67

np.int64(67)

In [50]:
harry['Speed '][0] = 100
# we update the value of speed to 100
# this method is not advisable

C:\Users\Vikra\AppData\Local\Temp\ipykernel_13700\3119987439.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed '][0] = 100

In [51]:
harry['Speed ']

0    100
1     57
2     87
3     45
4     90
Name: Speed , dtype: int64

In [52]:
harry.to_csv ('vikram.csv')
# we are updating changes to csv file

In [54]:
# how to change index of csv file
harry.index = ['first','second','third','fourth','fifth']

In [55]:
harry

        Train no  Speed      City
first      12233     100    Delhi
second     12351      57  Kolkata
third      12561      87   mumbai
fourth     24376      45    patna
fifth      23425      90  asansol